<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"9083196ef8753af93992474edb1bb6f03c342fac8fe98ed8cd463ef095c2f879","plan_job_ref":"Job terraform plan #262 at https://github.com/suzutan/infra/actions/runs/22298282131","plan_out_hash":"0b9b9953ecca30ed973b3f7b834272f42172fd810523840855cb214554002bd4","plan_hash":"106c1d05fd40d533f8b901af49ce5b002401f0787f310caa752dd8fb7c98b504","plan_text_format":"diff","version":"2.2.3","closed":true} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_r2_custom_domain.grathnode must be replaced
-/+ resource "cloudflare_r2_custom_domain" "grathnode" {
!~      status       = {
!~          ownership = "unknown" -> (known after apply)
!~          ssl       = "unknown" -> (known after apply)
        } -> (known after apply)
+       zone_id      = "98fc606abe946efeabebe1fdbf0af490" # forces replacement
+       zone_name    = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_application.livesync will be updated in-place
!~  resource "cloudflare_zero_trust_access_application" "livesync" {
        id                         = "0ea769a3-41c8-4aec-a63e-e5c2d7825fc8"
        name                       = "Obsidian LiveSync (CouchDB)"
+       options_preflight_bypass   = true
#        (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [terraform apply #168](https://github.com/suzutan/infra/actions/runs/22298311058)
<details><summary>Outputs</summary>

```hcl
archia_tunnel_id                          = "cd6f7222-15f6-40bc-a858-526e2890f20e"
archia_tunnel_token                       = (sensitive value)
github_actions_cf_access_client_id        = (sensitive value)
github_actions_cf_access_client_secret    = (sensitive value)
harvestasya_tunnel_token                  = (sensitive value)
obsidian_livesync_cf_access_client_id     = (sensitive value)
obsidian_livesync_cf_access_client_secret = (sensitive value)
oracle_tunnel_id                          = "411a294c-b51f-4b61-ba1f-fe7b916b37d8"
oracle_tunnel_token                       = (sensitive value)
vista_tunnel_id                           = "c410c2e1-484b-402c-bc86-05a01c922e46"
web_tunnel_id                             = "c1e6260a-e43b-4a32-a405-dbbd063cddb3"
web_tunnel_token                          = (sensitive value)
```
</details>